app/controllers/listings_controller.rb

SELECT "listings".* FROM "listings" WHERE "listings"."user_id" = 5 ORDER BY created_at DESC
---
  def seller
    @listings = Listing.where(user: current_user).order("created_at DESC")