app/controllers/listings_controller.rb

SELECT "listings".* FROM "listings" ORDER BY created_at DESC
---
  def index
    @listings = Listing.all

INSERT INTO "listings" ("name", "description", "price", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @listing = Listing.new(listing_params)
    @listing.user_id = current_user.id

    respond_to do |format|
      if @listing.save

UPDATE "listings" SET "image_updated_at" = ?, "updated_at" = ?, "image_file_name" = ? WHERE "listings"."id" = ?  [["image_updated_at", 2017-01-06 21:44:18 UTC], ["updated_at", 2017-01-06 21:44:19 UTC], ["image_file_name", "sunset.jpg"], ["id", 11]]
---
  def update
    respond_to do |format|
      if @listing.update(listing_params)

DELETE FROM "listings" WHERE "listings"."id" = ?  [["id", 1]]
---
  def destroy
    @listing.destroy

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_listing
      @listing = Listing.find(params[:id])