app/controllers/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."seller_id" = 3 ORDER BY created_at DESC
---
  def sales
    @orders = Order.all.where(seller: current_user).order("created_at DESC")

SELECT "orders".* FROM "orders" WHERE "orders"."buyer_id" = 3 ORDER BY created_at DESC
---
  def purchases
    @orders = Order.all.where(buyer: current_user).order("created_at DESC")

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def new
    @order = Order.new
    @listing = Listing.find(params[:listing_id])

SELECT  "listings".* FROM "listings" WHERE "listings"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
INSERT INTO "orders" ("address", "city", "state", "created_at", "updated_at", "buyer_id", "seller_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["address", "1 Rainbow Road"], ["city", "San Francisco"], ["state", "CA"], ["created_at", 2017-01-10 00:38:00 UTC], ["updated_at", 2017-01-10 00:38:00 UTC], ["buyer_id", 3], ["seller_id", 3]]
---
  def create
    @order = Order.new(order_params)
    @listing = Listing.find(params[:listing_id])
    @seller = @listing.user

    @order.listing_id = @listing.id
    @order.buyer_id = current_user.id
    @order.seller_id = @seller.id

    respond_to do |format|
      if @order.save